import json

import requests

# # 招标公告
# url = 'https://ggj.chizhou.gov.cn/front/bidcontent/9005001002'
# # 中标公告
# url = 'https://ggj.chizhou.gov.cn/front/bidcontent/9005001004'
# 中标候选人公示
url = "https://ggj.chizhou.gov.cn/front/bidcontent/9005001003"

def get_response(searchkey):
    payload = json.dumps({
        "filter": {
            "date": "",
            "regionCode": "",
            "tenderProjectType": "",
            "tenderMode": ""
        },
        "page": 1,
        "rows": 15,
        "searchKey": searchkey
    })
    headers = {
        'Content-Type': 'application/json',
        'Cookie': 'wzws_sessionid=gDE3MS4yMTcuOTIuNjeBYWRlNTBhgmJhZGE1YqBk9n9X'
    }

    response = requests.request("POST", url, headers=headers, data=payload)
    data = response.text
    return data

searchkeys = ["池州城市市政公服基地（一期）EPC总承包", "池州市城东污水处理厂二期及管网改造工程项目（EPC)", "池州市第一中学校园安全和育人环境提升改造EPC总承包", "石台秋浦河文旅综合体项目EPC总承包", "长江经济带池州市天堂湖片区基础设施一体化提升工程（长江南路延伸段附属工程）EPC总承包项目", "池州职业技术学院实验实训综合提升项目（二期）F+EPC", "S225齐山至万罗山信息化及照明工程", "青阳县临城南路绿化工程", "安徽省东至经济开发区河沟水生态环境提升工程", "2023年青阳县高标准农田改造提升建设项目IV标段（酉华、朱备镇）", "石台县城东安置小区一期", "池州市第一中学校园安全和育人环境提升改造EPC总承包", "石台县仙寓镇七洪路升级改造工程", "2021年贵池区殷汇镇高标准农田建设项目一标段（马草深村）", "2021年贵池区秋江街道莲台村高标准农田建设项目Ⅰ标段", "市人民医院传染病区拆除重建项目智能化工程", "东至县污水处理厂二期扩建工程（土建）", "东至县胜利镇中心幼儿园改建等校安工程", "石台县查上河小流域水土保持综合治理工程", "青阳县水源地保护防护设施工程", "东至县舜城新区供水主干管工程项目", "石台县仙寓镇杨树村至七里坞公路升级改造工程", "池州市石台县人民医院急诊综合楼项目", "东至县敬慈小学和附属幼儿园校安工程真石漆专业分包项目", "青阳县七步泉路（青童路至天柱路）道排工程", "东至县敬慈小学和附属幼儿园校安工程窗户栏杆扶手专业分包项目", "安东盛品蘭庭（东区、西区）土方工程专业分包（二标段）", "安东盛品蘭庭（东区、西区）土方工程专业分包（一标段）", "东至县花园乡初级中学餐厅宿舍楼扩建（校安工程）项目", "天华路（莲花路至四中南侧院墙段）道排工程", "丁桥镇美丽集镇建设集镇改造工程", "池州市东至县龙泉镇中心学校本部小学教学楼及教辅用房等校安工程项目(食堂、场地等附属工程）", "杜村乡美丽集镇建设主干道升级改造工程", "东至县实验小学城南托幼中心（新校区二期）校安工程", "青阳县锦绣路（望华路至天柱路段）道排工程", "安东盛品蘭庭窗户工程专业分包三标段（西区商品房）", "安东盛品蘭庭窗户工程专业分包二标段（东区商品房）", "安东盛品蘭庭东区入户门专业分包一标段", "安东盛品蘭庭（东区、西区）栏杆扶手专业分包二标段", "安东盛品蘭庭西区入户门专业分包二标段", "安东盛品蘭庭（东区、西区）栏杆扶手专业分包一标段", "安东国瑞装配式建筑产业示范基地门窗工程专业分包", "皖江江南新兴产业集中区乐山路（洛河路-皖江西路）路面提升工程", "石台县城市公益性公墓建设项目（墓园工程）", "石台县实验小学教学楼、风雨操场及附属工程", "石台县城东安置小区二期", "池州市贵池区馨香花园安置点A区A1#~A6#及地下室土建工程项目", "大九华宾馆商务楼改造项目室内装饰安装工程一标段（1至3层）", "大九华宾馆商务楼改造项目室内装饰安装工程三标段（10至15层）", "大九华宾馆商务楼改造项目室内装饰安装工程二标段（4至9层）", "安徽交通中等职业技术学校（池州体育运动学校）体育训练场馆提升项目", "青阳县2022年农村公路预养护工程一标段（上粽路、东厚路）", "东至县大渡口镇新丰圩行政村河南中心村生活污水治理工程", "池州市贵池区梅里新村一期（B区）安置点B1#~B6#楼及地下室土建工程", "安东盛和凯里栏杆及扶手专业分包", "安东盛和凯里门窗工程专业分包", "清溪河沿岸环境整治与环境提升工程EPC总承包项目", "国家税务总局池州市贵池区税务局综合业务办公用房维修改造项目", "池州市儿童医院暨妇幼保健院发热门诊项目", "池州市贵池区墩上街道办事处墩上街道新时代实践所工程", "青阳县杨家畈桥改建工程", "七都镇乡村振兴产业园建设项目一期4#、5#厂房及附属项目", "东至县香隅镇梅山小学（香隅中心学校本部分校）教学楼及教辅用房等校安工程项目（一期）", "东至县张溪镇农村环境综合整治项目", "安东·盛和凯里小区外墙保温和外墙真石漆专业分包工程一标段", "安东·盛和凯里小区外墙保温和外墙真石漆专业分包工程二标段", "东至县胜利路道路工程", "安东盛品蘭庭西区外墙真石漆专业分包项目二标段", "安东盛品蘭庭东区外墙真石漆专业分包项目一标段", "大渡口经开区仙寓山安置房三期工程（一期）真石漆、保温工程专业分包工程（二标段）", "大渡口经开区仙寓山安置房三期工程（一期）真石漆、保温工程专业分包工程（一标段）", "09070003工程施工项目", "东至县大渡口镇中心学校新城幼儿园建设项目（校安工程）", "东至经开区产业大道（香苑大道-东二环）土石方及排水工程专业分包", "东至县G530居民搬迁安置房（一期）防水工程专业分包", "东至县敬慈小学和附属幼儿园校安工程建设项目（幼儿园装饰及附属工程）", "206国道赤头-东流沿线整体景观改造与绿化提升工程", "东至县G530居民搬迁安置房（一期）消防工程专业分包", "安东盛华锦都小区绿化专业分包工程", "石台县仙寓镇S473至仙牌路连接路升级改造工程", "东至县县城第二配水厂土建施工工程", "池州市东至县城南幼儿园(校安工程)建设项目", "青阳县经济开发区产业提升建设项目（标准化厂房一期工程）", "河西消防大队等片区污水收集工程", "东至县血防站医院住院大楼建设项目", "皖江江南新兴产业集中区全民健身中心项目", "东至县天文气象研学馆项目（EPC总承包）", "2021年青阳县农村公路改造工程（童朱路改造工程）", "2021年度主城区干道（沿街）建筑外墙脱落维修工程（IV标段）", "2021年度主城区干道（沿街）建筑外墙脱落维修工程（III标段）", "池州高新区电子信息区( A区)基础设施提升—职工宿舍改造项目", "池州市人民医院二号楼改造项目", "皖江江南新兴产业集中区全民健身中心项目", "东至县血防站医院住院大楼建设项目", "河西消防大队等片区污水收集工程", "青阳县经济开发区产业提升建设项目（标准化厂房一期工程）", "池州市东至县城南幼儿园(校安工程)建设项目", "东至县县城第二配水厂土建施工工程", "石台县仙寓镇S473至仙牌路连接路升级改造工程", "贵池区县道513双观路（观前敬老院至凤鸣大道）改建工程", "安东盛华锦都小区绿化专业分包工程", "206国道赤头-东流沿线整体景观改造与绿化提升工程", "东至县敬慈小学和附属幼儿园校安工程建设项目（幼儿园装饰及附属工程）", "东至县G530居民搬迁安置房（一期）防水工程专业分包", "池州高新区标准化厂房新建维修及改造项目（一期）", "东至经开区周边和G530居民搬迁安置房一期工程劳务作业分包", "东至经开区产业大道（香苑大道-东二环）土石方及排水工程专业分包", "东至经济开发区特勤消防站和应急救援队建设工程-室外附属", "东至县大渡口镇中心学校新城幼儿园建设项目（校安工程）", "池州港乌沙港区公用码头进港道路设计施工总承包项目（EPC）", "大渡口经开区仙寓山安置房三期工程（一期）真石漆、保温工程专业分包工程（二标段）", "大渡口经开区仙寓山安置房三期工程（一期）真石漆、保温工程专业分包工程（一标段）", "江南智慧人才公寓项目（一期）EPC总承包项目", "安东盛品蘭庭西区外墙真石漆专业分包项目二标段", "安东盛品蘭庭东区外墙真石漆专业分包项目一标段", "东至县胜利路道路工程", "东至县张溪镇农村环境综合整治项目", "东至县滨湖经济园区基础设施建设工程（创业路）", "东至县香隅镇梅山小学（香隅中心学校本部分校）教学楼及教辅用房等校安工程项目（一期）", "七都镇乡村振兴产业园建设项目一期4#、5#厂房及附属项目", "池州市贵池区墩上街道办事处墩上街道新时代实践所工程", "池州市儿童医院暨妇幼保健院发热门诊项目", "国家税务总局池州市贵池区税务局综合业务办公用房维修改造项目", "大渡口经开区仙寓山安置房三期工程（一期）劳务作业分包项目", "安东盛和凯里门窗工程专业分包", "安东盛和凯里栏杆及扶手专业分包", "池州市贵池区梅里新村一期（B区）安置点B1#~B6#楼及地下室土建工程", "东至县大渡口镇新丰圩行政村河南中心村生活污水治理工程", "大九华宾馆商务楼改造项目室内装饰安装工程三标段（10至15层）", "大九华宾馆商务楼改造项目室内装饰安装工程二标段（4至9层）", "大九华宾馆商务楼改造项目室内装饰安装工程一标段（1至3层）", "池州市贵池区馨香花园安置点A区A1#~A6#及地下室土建工程项目", "石台县城东安置小区二期", "石台县实验小学教学楼、风雨操场及附属工程", "石台县城市公益性公墓建设项目（墓园工程）", "皖江江南新兴产业集中区乐山路（洛河路-皖江西路）路面提升工程", "安东国瑞装配式建筑产业示范基地门窗工程专业分包", "青阳县锦绣路（望华路至天柱路段）道排工程", "杜村乡美丽集镇建设主干道升级改造工程", "池州市东至县龙泉镇中心学校本部小学教学楼及教辅用房等校安工程项目(食堂、场地等附属工程）", "丁桥镇美丽集镇建设集镇改造工程", "天华路（莲花路至四中南侧院墙段）道排工程", "木镇镇木瓜山路延伸段建设工程项目", "东至县花园乡初级中学餐厅宿舍楼扩建（校安工程）项目", "安东盛品蘭庭（东区、西区）土方工程专业分包（二标段）", "安东盛品蘭庭（东区、西区）土方工程专业分包（一标段）", "池州市2023年普通国省干线公路G206堰上桥危桥改造工程", "2023年青阳县城区交通设施维修建设工程", "池州市2023年普通国省干线公路（国道）安全提升工程Ⅰ标段", "池州市2023年普通国省干线公路（国道）安全提升工程Ⅱ标段", "池州市2023年普通国省干线公路（国道）危旧桥梁改造工程Ⅴ标段（第二次）", "池州市2023年普通国省干线公路路面修复与预防性养护工程Ⅱ标段", "池州市2023年普通国省干线公路路面修复与预防性养护工程Ｉ标段", "池州市2023年普通国省干线公路（国道）危旧桥梁改造工程Ⅵ标段", "石台县仙寓镇S473至仙牌路连接路升级改造工程", "贵池区县道513双观路（观前敬老院至凤鸣大道）改建工程", "池州市2023年普通国省干线公路（国道）危旧桥梁改造工程III标段", "池州市2023年普通国省干线公路（国道）危旧桥梁改造工程IV标段", "池州市2023年普通国省干线公路（国道）危旧桥梁改造工程II标段", "池州市2023年普通国省干线公路（国道）危旧桥梁改造工程I标段", "池州市2022年(第二批)普通国省干线公路（省道）危旧桥改造工程Ⅱ标段及G237焦槽桥", "池州市2022年（第二批）普通国省干线公路路面修复养护工程Ⅰ标段及S225灾害防治工程", "池州市2022年（第二批）普通国省干线公路路面修复养护工程Ⅱ标段", "石台县2022年农村公路养护工程（仁七路(伍石路)预防性养护工程）", "池州市2022年普通国省干线公路路面修复与预防性养护工程（S473横洪线 K0+000-K36+660段）", "石台县仙寓镇杨树村至七里坞公路升级改造工程", "池州市2020年普通国省干线公路灾毁恢复重建项目（S234杨闪路K75+250～K89+447）", "石台县仙寓镇七洪路升级改造工程", "2021年青阳县农村公路改造工程（童朱路改造工程）",]
for searchkey in set(searchkeys):
    data = get_response(searchkey)

    # 将JSON数据解析为Python对象
    data_obj = json.loads(data)
    # 获取rows列表
    rows = data_obj['rows']
    # 遍历rows列表，提取bidSectionCodes值
    bidSectionCodes = [row['id'] for row in rows]
    # 输出结果
    print(bidSectionCodes)
    for bidSectionCode in bidSectionCodes:
        print(f"{url}/{bidSectionCode}")
